//
// Note: as comments are not supported by JSON format, this file is not directly usable!
// Use the file "example.json" instead: it has identical contents without comments.
//
{
    "copasi" : {
	// COPASI model file name; @SELF@ refers to CoRunner source directory
        "modelFile" : "@SELF@/models/simple-6params.cps",
	// which and how many methods to use; can contain a method more than once
        "methods" : ["ParticleSwarm", "GeneticAlgorithm", "GeneticAlgorithmSR", "EvolutionaryProgram", "EvolutionaryStrategySR", "ScatterSearch", "SimulatedAnnealing"],
	// which and how many methods to use when a method fails to evaluate the objective function in given time
        "fallbackMethods" : ["GeneticAlgorithmSR", "EvolutionaryStrategySR"],
	// whether to pick methods from the configuration randomly or in order (default: false)
        "randomizeMethodSelection" : false,
	// whether to use optimization method parameters from COPASI model file (default: false)
        "methodParametersFromFile" : false,
    },
    "optimization" : {
	// maximal CPU time for optimization in case convergence criteria and other end conditions have not been reached (default: 600 sec)
        "timeLimitSec" : 60,
	// for determining whether the convergence criteria of multiple solutions has been reached (default: 1%)
        "consensusRelativeError" : 0.01,
	// for determining whether the convergence criteria of multiple solutions has been reached (default: 1e-6)
        "consensusAbsoluteError" : 1e-6,
	// minimal time to continue after convergence criteria has been reached (default: 300 sec )
        "consensusMinDurationSec" : 30,
	// minimal time to continue after convergence criteria has been reached as proportion of runtime so-far (default: 15%)
        "consensusMinProportionalDuration" : 0.15,
	// compared to already found solution (default: 0.9, range: (0.0  .. 1.0])
        "optimalityRelativeError" : 0.1,
	// known best value of an already found solution
        "bestOfValue" : -Infinity,
	// restart each subsequent method from the best point in the search space so far (default: true)
        "restartFromBestValue" : true,
	// how many COPASI processes to run by parallel (default: max(4, the number of CPU cores); range: [1 .. number of CPU cores])
        "maxConcurrentRuns" : 4,
	// how many paraller COPASI exectutions to per single job (i.e. a single set of parameters)
        "runsPerJob" : 2
    },
    // .csv file name on which to restart optimization runs, trying to complete timeouted jobs (default: null)
    "restartOnFile" : null,
    // parameter ranges which to use for optimization
    "parameters" : [
	// an optimization all parameters included (default)
        {"type" : "all"},
 	// an optimization with exhaustive selection of 1 to 3 parameters (default)
        {"type" : "exhaustive", "range" : [1, 3]},
	// an optimization with greedy selection of 4 to 8 parameters (default)
        {"type" : "greedy", "range" : [4, 8]}
    ],
    "web" : {
	// whether to run the web interface (default: true)
	// WARNING: access control is not supported by CoRunner!
	// Enable this only in trusted environment.
        "enable" : true,
	// http port number (default: 19000)
        "port" : 19000
    },
    "output" : {
	// optimization results file name (default: "results-<taskname>-<datetime>.csv")
        "filename" : "results.csv",
	// debug log level; from 0 to 4, higher means more messages (default: 2)
        "loglevel" : 2,
	// how many of the best parameter combinations to include in results for each number of parameters; 0 means unlimited (default: unlimited)
        "numberOfBestCombinations" : 0
    },
    // the global name of this optimization task
    "taskName" : null
}
